[{"paperId":0,"paperTitle":"Investigation of the Type-2 Fuzzy Logic Approach to Classification in an EEG-based Brain-Computer Interface","author":["P. Herman","  G. Prasad","  T. M. McGinnity"],"conference":"2005 IEEE Engineering in Medicine and Biology 27th Annual Conference","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1615691","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1615691","abstract":"Analysis of electroencephalogram (EEG) requires a framework that facilitates handling the uncertainties associated with the varying brain dynamics and the presence of noise. Recently, the type-2 fuzzy logic systems (T2 FLSs) have been found effective in modeling uncertain data. This paper examines the potential of the T2 FLS methodology in devising an EEG-based brain-computer interface (BCI). In particular, a T2 FLS has been designed to classify imaginary left and right hand movements based on time-frequency information extracted from the EEG with the short time Fourier transform (STFT). Robustness of the method has also been verified in the presence of additive noise. The performance of the classifier is quantified with the classification accuracy (CA). The T2 fuzzy classifier has been proven to outperform its type-1 (T1) counterpart on all data sets recorded from three subjects examined. It has also compared favorably to the well known classifier based on linear discriminant analysis (LDA)","filepath":"..\/paper\/paper1.pdf"},{"paperId":1,"paperTitle":"Theory of soliton stability in asynchronous modelocking","author":["H. A. Haus","  D. J. Jones","  E. P. Ippen","  W. S. Wong"],"conference":"Journal of Lightwave Technology","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=491401","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=491401","abstract":"A new type of fiber laser modelocking is examined where a phase modulator is driven asynchronously with respect to a harmonic of the roundtrip cavity frequency. An asynchronous drive is able to produce high repetition rate (&gt;1 GHz) soliton pulses that are shorter than the classic, active modelocking pulse width limit. It is shown that with a proper choice of fiber parameters, noise cleanup and soliton pulse shaping can be obtained using filtering and asynchronous phase modulation. Limits of asynchronous detuning are derived and a comparison with the parameters ranges for synchronous phase modulation is also presented","filepath":"..\/paper\/paper2.pdf"},{"paperId":2,"paperTitle":"Design of a compliantly actuated exo-skeleton for an impedance controlled gait trainer robot","author":["Herman van der Kooij","  Jan Veneman","  Ralf Ekkelenkamp"],"conference":"2006 International Conference of the IEEE Engineering in Medicine and Biology Society","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4461717","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4461717","abstract":"We have designed and built a lower extremity powered exo-skeleton (LOPES) for the training of post-stroke patients. This paper describes the philosophy behind the design of LOPES, motivates the choices that have been made and gives some exemplary results of the ranges of mechanical impedances that can be achieved","filepath":"..\/paper\/paper3.pdf"},{"paperId":3,"paperTitle":"Developing a Java based RFID application to automate student attendance monitoring","author":["R. B. Kuriakose","  H. J. Vermaak"],"conference":"2015 Pattern Recognition Association of South Africa and Robotics and Mechatronics International Conference (PRASA-RobMech)","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=7359497","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=7359497","abstract":"Research has proved that there is a high correlation between high class attendance and academic performance. Learning is a progressive activity which builds upon those of the previous day(s). Reading material and working independently do not compensate for the loss of insight gained by being physically present in classroom environment. As a result attendance monitoring should be an integral part of any institution especially a tertiary institution. The major challenge that a facilitator has in monitoring attendance is the sheer paper work and subsequent administrative work that follows the process if it is done manually. Many techniques have been developed to automate attendance monitoring including the use of biometrics. These techniques have their own strengths and weaknesses. This paper describes a pilot experiment that was rolled out at the Central University Of Technology, Free State, South Africa where a Java based Radio Frequency Identification Technology (RFID) application was used to automate attendance monitoring. The paper first compares the challenges facing manual attendance monitoring. Secondly it looks at some of the possible solutions for automating attendance monitoring including RFID technology. Thirdly it shows how the hardware part is setup and finally it describes how Java programming is used to create a meaningful link between the data collected by the RFID hardware so as to automate the attendance register.","filepath":"..\/paper\/paper4.pdf"},{"paperId":4,"paperTitle":"Interferometry using a multi-photon tunneling coupler","author":["J. M. Fini","  P. L. Hagelstein","  H. A. Haus"],"conference":"Technical Digest. Summaries of papers presented at the Quantum Electronics and Laser Science Conference. Postconference Technical Digest (IEEE Cat. No.01CH37172)","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=961893","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=961893","abstract":"Summary form only given. Interferometers involving special quantum states can show fascinating and counter-intuitive effects. While the general principles governing these effects have been understood for some time, the recent discussion of photon DeBroglie waves has provided an interesting and useful perspective. The basic idea is that whenever photons display correlated dynamics as they pass through a nonlinear interferometer, a description in terms of multi-photon bound particles can be useful. Multi-photon particles behave quite differently from uncorrelated photons: a bound collection of N photons has total momentum N\/spl planck\/k. Interference of such particles has fringe period \/spl lambda\/\/N. This runs against our intuition for linear optics, although some implementations are intuitive. For example, if a system includes up-conversion, then \/spl lambda\/\/2 photons are produced, and the presence of interference at this wavelength is quite natural. Naturally, loss will impose limitations on this kind of coherent manipulation, and must be carefully studied. The Kerr coupler was proposed as a potential implementation of the above interferometer. The Kerr effect can provide a \"binding force\" holding a packet of photons together as it passes through the coupler. A number of issues must be addressed in any realistic design-including loss and temporal pulse shape. Here we study the basic effect using a simplified two-mode model.","filepath":"..\/paper\/paper5.pdf"},{"paperId":5,"paperTitle":"The ARTEMIS Cross-Domain Architecture for Embedded Systems","author":["Hermann Kopetz"],"conference":"2007 Design, Automation & Test in Europe Conference & Exhibition","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4212016","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4212016","abstract":"Today the embedded system market is a highly fragmented market, where custom-designed solutions dominate, resulting in a significant duplication of development effort for hardware, software and services. The ever-increasing complexity level of embedded systems, the technology trends of the semiconductor industry to large production series of chips, and the increased competition in the world market entail the need for a European-wide coherent and integrated development strategy for embedded systems. The ARTEMIS technology platform has been created to fill this need by joining the forces of many of the European players in the embedded system market in order to create the critical mass that is necessary to tackle the formidable challenges of the field","filepath":"..\/paper\/paper6.pdf"},{"paperId":6,"paperTitle":"Hybrid Diesel Generator - battery systems for offgrid rural applications","author":["K. Kusakana","  H. J. Vermaak"],"conference":"2013 IEEE International Conference on Industrial Technology (ICIT)","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6505781","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6505781","abstract":"This paper discusses the advantages of adding a battery storage system to isolated load not served by the grind and continuously running under a Diesel Generator. Even though adding batteries means increasing the Initial Cost of the system, the resulting Cost of Energy produced as well as the total Net Present Costs are sensibly being reduce while using the hybrid Diesel generator-battery system. HOMER is used to compare the technical, economical and environmental characteristics of the hybrid system to the stand alone diesel generator. Finally, the Cost of Energy produced as well as the total Net Present Costs can be further reduced by optimally sizing and applying optimal control strategies to the hybrid system. The decision variables as well as the objective function for the optimal sizing and operation control of the hybrid diesel generator-battery system have been proposed.","filepath":"..\/paper\/paper7.pdf"},{"paperId":7,"paperTitle":"Wedge-shaped, large-aperture, dipole magnet designs for the Jefferson Lab FEL upgrade","author":["D. Newsham","  A. Smirnov","  Y. Luo","  D. Yu","  G. Biallas"],"conference":"Proceedings of the 2003 Particle Accelerator Conference","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1288804","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1288804","abstract":"Two types of dipole magnets were simulated and designed for the Thomas Jefferson National Accelerator Facility FEL upgrade. The magnets are to operate in series with a common power supply, and to provide &sim;0.01% accuracy of the field amplitude and field integral over a large aperture. The wedged magnets have quite different angles and effective length-to-aperture aspect ratios. The most difficult design problem was to provide high field quality in the magnet having a small aspect ratio &sim;2.7 and a 20&deg; wedge angle. A design was developed which enabled small adjustments to be made before and after installation of the magnets. Trim coils, shims, and side sliders in the field clamps were introduced to compensate field gradients, non-uniformities, and parasitic fringe field effects. A number of design and adjustment issues are discussed.","filepath":"..\/paper\/paper8.pdf"},{"paperId":8,"paperTitle":"Improvement of the Performance of FM-CW Radar Systems by using Direct Digital Synthesizers: Comparison with Voltage Controlled Oscillators","author":["Jordi Figueras i Ventura","  Herman Russchenberg"],"conference":"2006 International Radar Symposium","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4338068","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4338068","abstract":"linear frequency modulated continuous wave (LFM-CW) radars require high linearity and good phase noise characteristics of its modulated signal to obtain a good resolution and sensitivity. Direct digital Synthesis (DDS) is becoming an increasingly competitive alternative to traditional Voltage Controlled Oscillators (VCO) to perform the modulation. Although there are plenty of publications describing the performance of the DDS, there has up to now not been any direct comparison between the performance of the DDS and the VCO as applied in FM-CW radars. In this paper the performance of DDS is analyzed both theoretically and with measurements. The performance of DDS in a linear frequency modulated continuous wave (LFM-CW) radar system, (the Transportable Atmospheric Radar TARA developed in IRCTR), is compared to a VCO demonstrating its superiority. DDS is, therefore, expected to play an important role in radar systems in the near future.","filepath":"..\/paper\/paper9.pdf"},{"paperId":9,"paperTitle":"A Petawatt Class Laser Irradiation System for Laser-Matter Interactions","author":["D. M. Pennington","  M. D. Perry","  J. A. Britten","  C. G. Brown","  S. Herman","  J. L. Miller","  B. C. Stuart","  G. Tietbohl","  V. Yanovsky"],"conference":"Technical Digest. 1998 EQEC. European Quantum Electronics Conference (Cat. No.98TH8326)","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=715103","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=715103","abstract":"First Page of the Article","filepath":"..\/paper\/paper10.pdf"},{"paperId":10,"paperTitle":"Micro-ring resonator channel dropping filters","author":["B. E. Little","  S. T. Chu","  H. A. Haus"],"conference":"Lasers and Electro-Optics Society Annual Meeting, 1995. 8th Annual Meeting Conference Proceedings, Volume 1., IEEE","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=484681","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=484681","abstract":"Micro-ring and disk resonators side coupled to an optical signal bus may serve as channel dropping filters with sufficient free spectral range to cover the erbium amplifier bandwidth, (30 nm-50 nm). Singly and multiply coupled resonators are investigated analytically and numerically to determine their potential","filepath":"..\/paper\/paper11.pdf"},{"paperId":11,"paperTitle":"The modulation instability laser. II. Theory","author":["M. Nakazawa","  K. Suzuki","  H. Kubota","  H. A. Haus"],"conference":"IEEE Journal of Quantum Electronics","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=35231","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=35231","abstract":"For pt.I see ibid., vol.25, no.9, p.2036-44 (1989). A general analysis of the modulation instability laser (MIL) in a nonlinear dispersive cavity is presented. The theory of the feedback-induced modulational instability is derived. By introducing the pump depletion within one circulation of the pump pulse, the steady-state MIL oscillation can be predicted. The ripple frequency is equal to the modulation instability frequency","filepath":"..\/paper\/paper12.pdf"},{"paperId":12,"paperTitle":"New insights in the relation between electron trap generation and the statistical properties of oxide breakdown","author":["R. Degraeve","  G. Groeseneken","  R. Bellens","  J. L. Ogier","  M. Depas","  P. J. Roussel","  H. E. Maes"],"conference":"IEEE Transactions on Electron Devices","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=662800","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=662800","abstract":"In this paper it is demonstrated in a wide stress field range that breakdown in thin oxide layers occurs as soon as a critical density of neutral electron traps in the oxide is reached. It is proven that this corresponds to a critical hole fluence, since a unique relationship between electron trap generation and hole fluence is found independent of stress field and oxide thickness. In this way literature models relating breakdown to hole fluence or to trap generation are linked. A new model for intrinsic breakdown, based on a percolation concept, is proposed. It is shown that this model can explain the experimentally observed statistical features of the breakdown distribution, such as the increasing spread of the QBD-distribution for ultrathin oxides. An important consequence of this large spread is the strong area dependence of the QBD for ultrathin oxides","filepath":"..\/paper\/paper13.pdf"},{"paperId":13,"paperTitle":"Letters to the editor","author":["F. V. Andreae","  H. B. Dwight","  H. A. P. Langstaff","  K. B. Mceachron","  Edward Beck","  Herman Halperin"],"conference":"Electrical Engineering","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6430461","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6430461","abstract":"CONTRIBUTIONS to these columns are invited from Institute members and subscribers. They should be concise and may deal with technical papers, articles published in previous issues, or other subjects of some general interest and professional importance. ELECTRICAL ENGINEERING will endeavor to publish as many letters as possible, but of necessity reserves the right to publish them in whole or in part, or to reject them entirely.","filepath":"..\/paper\/paper14.pdf"},{"paperId":14,"paperTitle":"Bevelled-microlensed taper connectors for laser and fibre coupling with minimal back-reflections","author":["H. M. Presby","  A. Benner"],"conference":"Electronics Letters","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=19607","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=19607","abstract":"A new means for coupling single-mode fibre to semiconductor lasers with efficiencies greater than 60% and back-reflections below -60 dB is demonstrated. The method consists of utilising a CO\/sub 2\/-laser-microlensed, expanded-beam, bevelled-taper connector. This connector design also serves to eliminate back-reflections wherever it is used in a fibre system as an interconnection element.>","filepath":"..\/paper\/paper15.pdf"},{"paperId":15,"paperTitle":"Electronically-Tunable, Low Noise Ka-Band Paramp-Downconverter Satellite Communications Receiver","author":["H. C. Okean","  J. A. DeGruyl","  L. J. Steffek","  A. J. Kelly","  S. J. Foti"],"conference":"1975 IEEE-MTT-S International Microwave Symposium","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1123273","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1123273","abstract":"The Ka-band-to-UHF parametric amplifier-downconverter satellite communications receiver described herein provides less than 4 dB SSB noise figure over either electronically selectable sideband of the externally supplied- 37.5 GHz local oscillator, each of which is downconverted to a fixed 500-650 MHz IF output band. To achieve such widely tunable low noise performance, this receiver utilizes state-of-the-art varactors, a unique, solid-state pumped Ka-band paramp design and a low noise balanced mixer-transistor IF amplifier, incorporated with associated power supply and thermal stabilization in a self-contained 6\" &#x00D7; 5\" &#x00D7; 4\" package.","filepath":"..\/paper\/paper16.pdf"},{"paperId":16,"paperTitle":"A Personal Surround Environment: Projective Display with Correction for Display Surface Geometry and Extreme Lens Distortion","author":["Tyler Johnson","  Florian Gyarfas","  Rick Skarbez","  Herman Towles","  Henry Fuchs"],"conference":"2007 IEEE Virtual Reality Conference","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4161017","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=4161017","abstract":"Projectors equipped with wide-angle lenses can have an advantage over traditional projectors in creating immersive display environments since they can be placed very close to the display surface to reduce user shadowing issues while still producing large images. However, wide-angle projectors exhibit severe image distortion requiring the image generator to correctively pre-distort the output image. In this paper, we describe a new technique based on Raskar's (1998) two-pass rendering algorithm that is able to correct for both arbitrary display surface geometry and the extreme lens distortion caused by fisheye lenses. We further detail how the distortion correction algorithm can be implemented in a real-time shader program running on a commodity GPU to create low-cost, personal surround environments","filepath":"..\/paper\/paper17.pdf"},{"paperId":17,"paperTitle":"Vertical benchmarks for CAD","author":["C. Inacio","  H. Schmit","  D. Nagle","  A. Ryan","  D. E. Thomas","  Yingfai Tong","  B. Klass"],"conference":"Proceedings 1999 Design Automation Conference (Cat. No. 99CH36361)","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=781350","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=781350","abstract":"Vertical benchmarks are complex system designs represented at multiple levels of abstraction. More effective than component-based CAD benchmarks, vertical benchmarks enable quantitative comparison of CAD techniques within or across design flows. This work describes the notion of vertical benchmarks and presents our benchmark, which is based on a commercial DSP, by comparing two alternative design flows","filepath":"..\/paper\/paper18.pdf"},{"paperId":18,"paperTitle":"A low-power 16-bit multiplier-accumulator using series-regulated mixed swing techniques","author":["R. K. Krishnamurthy","  H. Schmit","  L. R. Carley"],"conference":"Proceedings of the IEEE 1998 Custom Integrated Circuits Conference (Cat. No.98CH36143)","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=695027","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=695027","abstract":"This paper describes an on-chip series-regulated mixed swing methodology with sleep-mode control for lowering the power consumption of high-performance DSP multiplier-accumulator (MAC) circuits. A 16*16+36-bit overlapped bit-pair Booth recoded Wallace tree MAC is fabricated in a commercial 0.5 &mu;m CMOS process in the proposed series-regulated methodology and conventional static CMOS. Up to 2.55&times; reduction in energy\/operation is measured over static CMOS, while offering a simultaneous 1.8&times; improvement in low-voltage manufacturability. At the maximum clock frequency of 67 MHz, the proposed approach consumes a total MAC power of 16.6 mW in active mode and 152.5 nW in standby mode. Measured peak-peak power\/ground bounce is under 8% of the regulated low-swing voltage. Experimental results from comparisons in three additional (0.35 &mu;m, 0.25 &mu;m, 0.16 &mu;m) CMOS and fully-depleted SOI processes are also presented to demonstrate improved savings over static CMOS with process scaling","filepath":"..\/paper\/paper19.pdf"},{"paperId":19,"paperTitle":"Self-organization of harmonic pulses in a passively modelocked stretched pulse erbium fiber ring laser","author":["K. S. Abedin","  J. T. Gopinath","  L. A. Jiang","  M. E. Grein","  H. A. Haus","  E. P. Ippen"],"conference":"The 15th Annual Meeting of the IEEE Lasers and Electro-Optics Society","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1159382","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1159382","abstract":"In summary, we have reported self-stabilization in a harmonic passively modelocked stretched pulse fiber laser. With no active modulation or optical feedback, a highly stable and periodic train of 125 fs pulses with a maximum repetition rate of 220 MHz and average output power of &sim;80mW was obtained from the laser. Supermode noise could be suppressed by more than &sim;75 dB, with pulse to pulse timing jitter of 1 ps.","filepath":"..\/paper\/paper20.pdf"},{"paperId":20,"paperTitle":"Striving for Zero Planned Outages: Monitoring Electrical Equipment Failure Indicators","author":["Gabriel J. Paoletti","  George Herman"],"conference":"IEEE Industry Applications Magazine","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=7091907","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=7091907","abstract":"Electrical system preventive and predictive maintenance methodologies have experienced growth due to new technologies. This article reviews the historical and current approaches to electrical equipment maintenance and also highlights available technologies that will support future modes of equipment maintenance. Low-voltage (LV) and medium-voltage (MV) systems are reviewed. The need for improved reliability and uptime of electrical systems continues, and effective monitoring systems support a new concept of zero planned outages. Monitoring the parameters linked to potential failure modes addresses two key needs: 1) to notify end users of a pending failure condition and 2) to recommend maintenance and\/or inspections based on a trending analysis of failure mode contributing parameters rather than planned outages. This article reviews both IEEE and end-user surveyed failure indicators and technologies to continuously monitor such failure indicators.","filepath":"..\/paper\/paper21.pdf"},{"paperId":21,"paperTitle":"A 1\/4\" true progressive scan 640(H)*480(V) FT-CCD for multimedia applications","author":["J. T. Bosiers","  E. Roks","  H. L. Peek","  Y. A. Boersma","  J. M. Van der Beyden"],"conference":"Proceedings of 1994 IEEE International Electron Devices Meeting","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=383289","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=383289","abstract":"A VGA-compatible 1\/4\" true progressive scan 640(H)\/spl times\/480(V) FT-CCD imager with 5.1\/spl times\/5.1 \/spl mu\/m\/sup 2\/ pixels designed for compact, low-power multimedia applications, is presented. To obtain high charge storage in this very small pixel, the profiled peristaltic CCD structure was combined with vertical anti-blooming. The three-phase pixel holds up to 60000 electrons. 20 MHz frame shift is achieved, yielding 75 dB smear suppression. Charge binning allows interlaced operation.>","filepath":"..\/paper\/paper22.pdf"},{"paperId":22,"paperTitle":"Extending the iTaSC Constraint-based Robot Task Specification Framework to Time-Independent Trajectories and User-Configurable Task Horizons","author":["Wilm Decré","  Herman Bruyninckx","  Joris De Schutter"],"conference":"2013 IEEE International Conference on Robotics and Automation","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6630835","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6630835","abstract":"In constraint-based programming, robot tasks are specified and solved as optimization problems with sets of constraints and one or multiple objective functions. In our previous work, we presented (i) a generic modeling approach for geometrically complex robot tasks, including the modeling of parametric uncertainty, in order to allow the robot task programmer to specify the optimization problem without explicitly writing down the different (possibly numerous and involved) constraint equations, and (ii) methods for solving these optimization problem online in the instantaneous case (reactive control), and offline in the non-instantaneous case (trajectory planning). This paper has two contributions. First, it extends our framework to include task constraints (e.g. tracking a curve) that are not given as explicit functions of time. These constraints are highly relevant in practice, for example to facilitate time-optimal path planning combined with other constraints. Second, it extends our framework to user-configurable task horizons when solving the optimization problem, to allow task programmers to make a trade-off between computational speed and (global) task optimality. Both of these novel framework extensions are illustrated by a time-optimal laser tracing experiment.","filepath":"..\/paper\/paper23.pdf"},{"paperId":23,"paperTitle":"Transient voltages on bonded cable sheaths","author":["Herman Halperin","  J. E. Clem","  K. W. Miller"],"conference":"Electrical Engineering","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6539595","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=6539595","abstract":"Field experience and tests show that unexpectedly high transient sheath voltages occur during the switching of charging current in single-conductor cable-type bus leads and in underground single-conductor power transmission cables bonded to eliminate sheath losses. No sheath troubles from these voltages have been found. Theoretical analysis of these voltages is presented together with suggested methods for protection of equipment, when the latter is necessary.","filepath":"..\/paper\/paper24.pdf"},{"paperId":24,"paperTitle":"Noise in Gunn oscillators","author":["H. A. Haus","  H. Statz","  R. A. Pucel"],"conference":"IEEE Transactions on Electron Devices","linkToDownload":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1477314","linkToBib":"http:\/\/ieeexplore.ieee.org\/stamp\/stamp.jsp?arnumber=1477314","abstract":"We estimate the ultimate noise of Gunn oscillators in the absence of 1\/  noise. The basic noise source considered is thermal or Johnson noise augmented by intervalley noise of carriers hopping between the high and low mobility bands. For example, for Qext= 102and Pout=10-1W we estimate &#948;frms&#8776; 1-2 Hz, and AM noise relative to the carrier of -156 dD, both measured in 1-kHz bandwidths.","filepath":"..\/paper\/paper25.pdf"},{"paperId":25,"paperTitle":"Is reconfigurable computing commercially viable (panel)?","author":["Herman Schmit"],"conference":"Proceedings of the 1997 ACM fifth international symposium on Field-programmable gate arrays  - FPGA '97","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=258318&expformat=bibtex","abstract":null,"filepath":"..\/paper\/paper26.pdf"},{"paperId":26,"paperTitle":"Automated contouring of vertical oceanographic sections using an objective analysis","author":["A. Herman"],"conference":"Proceedings of the 3rd annual conference on Computer graphics and interactive techniques  - SIGGRAPH '76","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=563314&expformat=bibtex","abstract":"This paper describes a group of computer programs developed for contouring vertical sections of oceanographic parameters. The vertical profiles can be constructed from data collected in a variety of ways. The input data for the driver subroutine need not be equally spaced horizontally or vertically. The routines are written in Fortran for a UNIVAC 1108 with an offline Gould Plotter, but can easily be adapted to any computer with a Fortran compiler and a plotter which accepts Calcomp-like commands. The routines are of modular construction.","filepath":"..\/paper\/paper27.pdf"},{"paperId":27,"paperTitle":"The information center as a middle ground in offsetting personnel obsolescence","author":["Herman Hoplin"],"conference":"The Proceedings of the Twentieth Annual Computer Personnel on Research Conference  -","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=800616&expformat=bibtex","abstract":"The primary purpose here is to present the profound impact of the IC on organizations and individuals; the concept's congealing force which is now patterning organizations forged around user interfaces and environments; and the dramatic effect of evolving an organization essentially with an innovative and effective mechanism for merging organizational and functional islands of information systems and services.","filepath":"..\/paper\/paper28.pdf"},{"paperId":28,"paperTitle":"Teaching abstraction explicitly (poster session)","author":["Herman Koppelman"],"conference":"Proceedings of the 6th annual conference on Innovation and technology in computer science education  - ITiCSE '01","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=377712&expformat=bibtex","abstract":"When one has to learn programming one has to learn a programming language, but also the concept of abstraction. Learning abstraction is not a logical consequence of learning a programming language. Moreover, it can be doubted whether novice programmers naturally tend to use abstraction. So, our approach is to teach abstraction explicitly to novices. We show that even for simple problems it makes sense to look for levels of abstraction in the problem definition and subsequently to design programs that reflect explicitly those levels of abstraction.We will discuss the way it works on the basis of a simple example.","filepath":"..\/paper\/paper29.pdf"},{"paperId":29,"paperTitle":"Bandpass filter approximation by interactive graphics","author":["Herman Daae"],"conference":"The proceedings of the thirteenth design automation conference on Design automation  - DAC '76, NO. 13","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=804805&expformat=bibtex","abstract":"In a lossless bandpass filter, the amplitude response function is determined by a certain number of coordinate points. For a given order and class of filter function the number of finite and infinite attenuation points is uniquely determined. Displaying the amplitude response with its selected set of coordinate points, this function may be varied by shifting the points with a light pen. Subsequent computation and display of the group time delay function facilitates a compromise between both response requirements. The process is applied to the example case design of a 12th order IF filter for color television receivers.","filepath":"..\/paper\/paper30.pdf"},{"paperId":30,"paperTitle":"Teaching abstraction explicitly (poster session)","author":["Herman Koppelman"],"conference":"ACM SIGCSE Bulletin","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=377712&expformat=bibtex","abstract":"When one has to learn programming one has to learn a programming language, but also the concept of abstraction. Learning abstraction is not a logical consequence of learning a programming language. Moreover, it can be doubted whether novice programmers naturally tend to use abstraction. So, our approach is to teach abstraction explicitly to novices. We show that even for simple problems it makes sense to look for levels of abstraction in the problem definition and subsequently to design programs that reflect explicitly those levels of abstraction.We will discuss the way it works on the basis of a simple example.","filepath":"..\/paper\/paper31.pdf"},{"paperId":31,"paperTitle":"Automated contouring of vertical oceanographic sections using an objective analysis","author":["A. Herman"],"conference":"ACM SIGGRAPH Computer Graphics","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=563314&expformat=bibtex","abstract":"This paper describes a group of computer programs developed for contouring vertical sections of oceanographic parameters. The vertical profiles can be constructed from data collected in a variety of ways. The input data for the driver subroutine need not be equally spaced horizontally or vertically. The routines are written in Fortran for a UNIVAC 1108 with an offline Gould Plotter, but can easily be adapted to any computer with a Fortran compiler and a plotter which accepts Calcomp-like commands. The routines are of modular construction.","filepath":"..\/paper\/paper32.pdf"},{"paperId":32,"paperTitle":"Organic program design","author":["Ted Herman"],"conference":"Proceedings of the 1975 annual conference on   - ACM 75","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=810368&expformat=bibtex","abstract":"The subject of programming methodology has recently become quite popular. Much has already been written about the topic [1], and various new systematic methods have been proposed. In the analysis of programming, many components are separated and their properties investigated. Certain workers have translated these conceptual resolutions into suggestions; often, it is recommended that one type “programming activity” be isolated, as far as possible, from another type of programming activity.One common proposal holds that the design of a program and the act of programming should not be miscegenated. This paper, another polemic foray into the area of programming methodology, questions the separation of program design from other programming activities.","filepath":"..\/paper\/paper33.pdf"},{"paperId":33,"paperTitle":"Self-stabilization at WSS'01 and DISC'01","author":["Ted Herman"],"conference":"ACM SIGACT News","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=507467&expformat=bibtex","abstract":null,"filepath":"..\/paper\/paper34.pdf"},{"paperId":34,"paperTitle":"Extra-dimensional island-style FPGAs","author":["Herman Schmit"],"conference":"Proceedings of the 1999 ACM\/SIGDA seventh international symposium on Field programmable gate arrays  - FPGA '99","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=296509&expformat=bibtex","abstract":null,"filepath":"..\/paper\/paper35.pdf"},{"paperId":35,"paperTitle":"From visions to reality","author":["Clem Herman"],"conference":"ACM SIGCAS Computers and Society","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=572310&expformat=bibtex","abstract":null,"filepath":"..\/paper\/paper36.pdf"},{"paperId":36,"paperTitle":"A comparison of disks and tapes","author":["Herman Hess"],"conference":"Communications of the ACM","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=367693&expformat=bibtex","abstract":"The principal characteristics of current magnetic disks and tape units are summarized and compared. Some of the characteristics of disk files are illustrated in a sorting example and compared to a tapesort. The conclusion is presented that disk files are competitive to tapes in some important applications.","filepath":"..\/paper\/paper37.pdf"},{"paperId":37,"paperTitle":"A Data Base Design Methodology for an Integrated Data Base Environment","author":["Marian Herman"],"conference":"Databases for Business and Office Applications, Database Week on -","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=711878&expformat=bibtex","abstract":null,"filepath":"..\/paper\/paper38.pdf"},{"paperId":38,"paperTitle":"Enriching a Course with Web Resources","author":["Herman Koppelman"],"conference":"Proceedings of the 2015 ACM Conference on Innovation and Technology in Computer Science Education - ITiCSE '15","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=2742601&expformat=bibtex","abstract":"The web offers a lot of resources that might be useful in higher education. This paper describes the experiences with a course that offers a lot of links to web resources. These resources are meant as enriching existing content and are announced as optional. The context is distance education. Through a survey we gained insight into the actual use of the web resources and in the appreciation of the different types of resources. Findings indicate that students differed greatly in their actual use of resources and also in their preferences. Many students preferred resources that could make them study efficiently, such as videos with summaries of subject matter or explanations of hard topics. Students benefitted from links to web resources that go together with relevant information about the resource, in order to be able to make sensible decisions whether to access a resource or not.","filepath":"..\/paper\/paper39.pdf"},{"paperId":39,"paperTitle":"Computer literacy scope and sequence models","author":["Herman Fischer"],"conference":"ACM SIGCUE Outlook","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=951652&expformat=bibtex","abstract":null,"filepath":"..\/paper\/paper40.pdf"},{"paperId":40,"paperTitle":"Exercises as a tool for sharing pedagogical knowledge","author":["Herman Koppelman"],"conference":"Proceedings of the 12th annual SIGCSE conference on Innovation and technology in computer science education  - ITiCSE '07","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1268933&expformat=bibtex","abstract":"We propose an approach of making pedagogical knowledge of CS instructors explicitly available by coupling it to exercises.","filepath":"..\/paper\/paper41.pdf"},{"paperId":41,"paperTitle":"A database design methodology for an integrated database environment","author":["Marian Herman"],"conference":"ACM SIGMIS Database","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1113503&expformat=bibtex","abstract":"The database design methodology used by a major US. commercial bank is described. The methodology is used for designing databases that support a large integrated real-time application. The methodology consists of four phases:• Conceptual Design• Detailed Conceptual Design• Logical Design• Physical DesignEach design phase corresponds to a particular phase of the standard project life cycle used at the organization. For each database design phase, data collection and analysis, required documentation, and review procedures are described.The bank's experience with and benefits derived from the design methodology are described, as well as current limitations of the methodology.","filepath":"..\/paper\/paper42.pdf"},{"paperId":42,"paperTitle":"Functional pearl","author":["David Herman"],"conference":"ACM SIGPLAN Notices","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1291177&expformat=bibtex","abstract":"Filinski showed that callcc and a single mutable reference cell are sufficient to express the delimited control operators shift and reset. However, this implementation interacts poorly with dynamic bindings like exception handlers. We present a variation on Filinski's encoding of delimited continuations that behaves appropriately in the presence of exceptions and give an implementation in Standard ML of New Jersey. We prove the encoding correct with respect to the semantics of delimited dynamic binding.","filepath":"..\/paper\/paper43.pdf"},{"paperId":43,"paperTitle":"Exercises as a tool for sharing pedagogical knowledge","author":["Herman Koppelman"],"conference":"ACM SIGCSE Bulletin","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1268933&expformat=bibtex","abstract":"We propose an approach of making pedagogical knowledge of CS instructors explicitly available by coupling it to exercises.","filepath":"..\/paper\/paper44.pdf"},{"paperId":44,"paperTitle":"Functional pearl","author":["David Herman"],"conference":"Proceedings of the 2007 ACM SIGPLAN international conference on Functional programming  - ICFP '07","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1291177&expformat=bibtex","abstract":"Filinski showed that callcc and a single mutable reference cell are sufficient to express the delimited control operators shift and reset. However, this implementation interacts poorly with dynamic bindings like exception handlers. We present a variation on Filinski's encoding of delimited continuations that behaves appropriately in the presence of exceptions and give an implementation in Standard ML of New Jersey. We prove the encoding correct with respect to the semantics of delimited dynamic binding.","filepath":"..\/paper\/paper45.pdf"},{"paperId":45,"paperTitle":"A process for creating the business case for user experience projects","author":["Jeff Herman"],"conference":"Extended abstracts of the 2004 conference on Human factors and computing systems  - CHI '04","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=986078&expformat=bibtex","abstract":"The eBay User Experience & Design (UED) group has had significant success sponsoring successful user experience (UE) projects, in large part by creating and communicating the business case for these projects. This paper presents the process the eBay UED group uses to get projects approved and how these projects are evaluated for success. This paper also refers to specific projects as examples that followed this process.","filepath":"..\/paper\/paper46.pdf"},{"paperId":46,"paperTitle":"The electrographic recording technique","author":["Herman Epstein"],"conference":"Proceedings of the March 1-3, 1955, western joint computer conference on - AFIPS '55 (Western)","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1455315&expformat=bibtex","abstract":"A set of criteria for evaluating recording techniques is reviewed. Features, applications, and the basic technique of electrographic recording are discussed.","filepath":"..\/paper\/paper47.pdf"},{"paperId":47,"paperTitle":"A logic oriented diagnostic program","author":["Herman Jacobowitz"],"conference":"Proceedings of the April 18-20, 1967, spring joint computer conference on - AFIPS '67 (Spring)","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/exportformats.cfm?id=1465605&expformat=bibtex","abstract":"The automatic diagnostic program has been with us for almost as long a time as the electronic digital computer, however the disparity between its achievements and its potentials has not been as successfully closed as it has for the computer itself. In the opinion of the author this is at least partly due to an only recently acquired understanding that the term \"diagnostic program\" is a misnomer insofar as it implies that the task is primarily one of programming rather than logic analysis.","filepath":"..\/paper\/paper48.pdf"},{"paperId":48,"paperTitle":"Computer literacy scope and sequence models a critical review of two approaches","author":["Herman Fischer"],"conference":"ACM SIGCSE Bulletin","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/","abstract":null,"filepath":"..\/paper\/paper49.pdf"},{"paperId":49,"paperTitle":"Computer system simulation of an on-line interactive command and control system","author":["Herman Fischer"],"conference":"Proceedings of the 5th conference on Winter simulation  - WSC '71","linkToDownload":"http:\/\/dl.acm.org\/","linkToBib":"http:\/\/dl.acm.org\/","abstract":null,"filepath":"..\/paper\/paper50.pdf"}]